[
  {
    "references": [
      {
        "DOI": "10.13140/RG.2.1.1721.1122",
        "publisher-place": "Bergen",
        "container-title": "4th Conference of the European Society for Research on Internet Interventions",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Jong",
            "dropping-particle": "de",
            "given": [
              "Franciska"
            ]
          }
        ],
        "id": "Dadvar2016",
        "issued": {
          "year": 2016
        },
        "abstract": "The Internet is ubiquitous. Our interactions along with our personal lives have become interwoven with the Internet. It has transformed interpersonal behaviour which has resulted in new forms of relationships and communication. With appearance of the Internet new form of societal problems, such as cyberbullying have emerged. Cyberbullying is an old social misconduct, known as bullying, that has found its way into virtual communities. Measures to reduce the frequency and impact of any online misbehaviour can be rooted in various perspectives. Computational approaches that aim to detect instances of cyberbullying are promising, but this paper argues that they should take a broader angle for combating the problem than the mere technical view. Social studies have reached valuable findings that can be used as informative sources in technical solutions. Taking the behavioural trends and personal characteristics of users can be beneficial for enhancing the effectiveness of tools for the automatic detection of online misbehaviour. The findings in our experimental works can be taken as an encouragement for researchers to integrate the knowledge of social and behavioural studies with those of technical research and take a more comprehensive look while tackling an online misbehaviour.",
        "title": "The Need for Joint Societal and Technical Solutions for Online Misbehaviour",
        "type": "paper-conference",
        "keyword": "Cyberbullying Detection,Expert Knowledge,Internet Intervention,Social Networks,Virtual Community"
      },
      {
        "DOI": "10.13140/RG.2.2.19904.12802",
        "publisher-place": "Porto",
        "container-title": "27th DEXA Conferences and Workshops",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Niamir",
            "given": [
              "Aidin"
            ]
          }
        ],
        "id": "Dadvar2016a",
        "issued": {
          "year": 2016
        },
        "abstract": "Bullying is a widespread problem in cyberspace and social networks. Therefore, in the recent years many studies have been dedicated to cyberbullying. Lack of appropriate dataset, due to variety of reasons, is one of the major obstacles faced in most studies. In this work we suggest that to overcome some of these barriers a model should be employed which is minimally affected by prevalence and small sample size. To this end we adopted the use of the Maximum Entropy method (MaxEnt) to identify the bully users in YouTube. The final results were compared with the commonly used methods. All models provided reasonable prediction of the bullying incidents. MaxEnt models had the highest discrimination capacity of bullying posts and the lowest sensitivity towards prevalence. We demonstrate that MaxEnt can be successfully adopted to cyberbullying studies with imbalanced datasets.",
        "title": "Adopting MaxEnt to Identification of Bullying Incidents in Social Networks",
        "type": "paper-conference",
        "keyword": "Bully,Cyberbullying,Maximum Entropy,Prevalence,Social Networks,YouTube"
      },
      {
        "DOI": "10.3990/1.9789036537391",
        "publisher-place": "Enschede, The Netherlands",
        "URL": "http://doc.utwente.nl/91720/ http://purl.org/utwente/doi/10.3990/1.9789036537391",
        "ISBN": 9789036537391,
        "author": {
          "family": "Dadvar",
          "given": [
            "Maral"
          ]
        },
        "id": "Dadvar2014",
        "issued": {
          "year": 2014,
          "month": 9
        },
        "abstract": "One from of online misbehaviour which has deeply affected society with harmful consequences is known as cyberbullying. Cyberbullying can simply be defined as an intentional act that is conducted through digital technology to hurt someone. Cyberbullying is a widely covered topic in the social sciences. However, studies on the technical dimensions of this topic are relatively rare. In this research the overall goal was to bridge the gap between social science approaches and technical solutions have thoroughly studied the origin of cyberbullying and its growth over time, as well as the role of technology in the emergence of this type of virtual behaviour and in the potential for reducing the extent of the social concern it raises. This thesis introduces a novel outlook towards the cyberbullying phenomenon. It looks into the gradual changes which have occurred in relationships and social communication with the emergence of the Internet. This study leads to the conviction that for combating cyberbullying, behavioural and psychological studies, and the study of technical solutions should go hand in hand. It was also shown that besides the conventional features used for text mining methods more personal features, such as gender and age of the users, can improve the accuracy of the detection models. We also study the use of experts’ knowledge and human reasoning to identify potential bully users in social networks. A hybrid approach is designed, incorporating machine learning models on top of the expert system, which outperforms each of the models individually. The integration of social studies into a software-enhanced monitoring workflow could pave the way towards the tackling of this kind of online misbehaviour. This work can be viewed as a contribution to the more general societal challenge of increasing the level of cybersecurity, in particular for the younger generations of social network users.",
        "title": "Experts and machines united against cyberbullying",
        "type": "thesis",
        "genre": "PhD thesis",
        "publisher": "University of Twente"
      },
      {
        "ISSN": 16113349,
        "DOI": "10.1007/978-3-319-06483-3_25",
        "volume": "8436 LNAI",
        "URL": "http://link.springer.com/10.1007/978-3-319-06483-3{\\_}25",
        "page": "275-281",
        "ISBN": 9783319064826,
        "container-title": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Trieschnigg",
            "given": [
              "Dolf"
            ]
          },
          {
            "family": "Jong",
            "dropping-particle": "de",
            "given": [
              "Franciska"
            ]
          }
        ],
        "id": "Dadvar2014a",
        "issued": {
          "year": 2014
        },
        "abstract": "Cyberbullying is becoming a major concern in online environments with troubling consequences. However, most of the technical studies have focused on the detection of cyberbullying through identifying harassing comments rather than preventing the incidents by detecting the bullies. In this work we study the automatic detection of bully users on YouTube. We compare three types of automatic detection: an expert system, supervised machine learning models, and a hybrid type combining the two. All these systems assign a score indicating the level of “bulliness” of online bullies. We demonstrate that the expert system outperforms the machine learning models. The hybrid classifier shows an even better performance.",
        "title": "Experts and Machines against Bullies: A Hybrid Approach to Detect Cyberbullies",
        "type": "chapter",
        "publisher": "Springer International Publishing"
      },
      {
        "URL": "http://purl.utwente.nl/publications/88358",
        "page": "57-64",
        "container-title": "25th Benelux Conference on Artificial Intelligence, BNAIC 2013",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Trieschnigg",
            "given": [
              "Dolf"
            ]
          },
          {
            "family": "Jong",
            "given": [
              "Franciska",
              "De"
            ]
          }
        ],
        "id": "Dadvar2013",
        "issued": {
          "year": 2013
        },
        "abstract": "Cyberbullying is a serious social problem in online environments and social networks. Current approaches to tackle this problem are still inadequate for detecting bullying incidents or to flag bullies. In this study we used a multi-criteria evaluation system to obtain a better understanding of YouTube users‟ behaviour and their characteristics through expert knowledge. Based on experts‟ knowledge, the system assigns a score to the users, which represents their level of “bulliness” based on the history of their activities, The scores can be used to discriminate among users with a bullying history and those who were not engaged in hurtful acts. This preventive approach can provide information about users of social networks and can be used to build monitoring tools to aid finding and stopping potential bullies.",
        "title": "Expert knowledge for automatic detection of bullies in social networks",
        "type": "article-journal",
        "publisher": "TU Delft"
      },
      {
        "ISSN": "03029743",
        "DOI": "10.1007/978-3-642-36973-5_62",
        "volume": "7814 LNCS",
        "URL": "http://link.springer.com/chapter/10.1007/978-3-642-36973-5{\\_}62 http://link.springer.com/10.1007/978-3-642-36973-5{\\_}62",
        "page": "693-696",
        "ISBN": 9783642369728,
        "container-title": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Trieschnigg",
            "given": [
              "Dolf"
            ]
          },
          {
            "family": "Ordelman",
            "given": [
              "Roeland"
            ]
          },
          {
            "family": "Jong",
            "dropping-particle": "de",
            "given": [
              "Franciska"
            ]
          }
        ],
        "id": "Dadvar2013a",
        "issued": {
          "year": 2013
        },
        "abstract": "The negative consequences of cyberbullying are becoming more alarming every day and technical solutions that allow for taking appropriate action by means of automated detection are still very limited. Up until now, studies on cyberbullying detection have focused on individual comments only, disregarding context such as users’ characteristics and profile information. In this paper we show that taking user context into account improves the detection of cyberbullying.",
        "title": "Improving Cyberbullying Detection with User Context",
        "type": "chapter"
      },
      {
        "DOI": "10.1145/2187980.2187995",
        "publisher-place": "New York, New York, USA",
        "URL": "http://dl.acm.org/citation.cfm?doid=2187980.2187995",
        "page": 121,
        "ISBN": 9781450312301,
        "container-title": "Proceedings of the 21st international conference companion on World Wide Web - WWW ’12 Companion",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Jong",
            "dropping-particle": "de",
            "given": [
              "Franciska"
            ]
          }
        ],
        "id": "Dadvar2012",
        "issued": {
          "year": 2012
        },
        "abstract": "s a result of the invention of social networks friendships, relationships and social communications have all gone to a new level with new definitions. One may have hundreds of friends without even seeing their faces. Meanwhile, alongside this transition there is increasing evidence that online social applications have been used by children and adolescents for bullying. State-of-the-art studies in cyberbullying detection have mainly focused on the content of the conversations while largely ignoring the users involved in cyberbullying. We propose that incorporation of the users’ information, their characteristics, and post-harassing behaviour, for instance, posting a new status in another social network as a reaction to their bullying experience, will improve the accuracy of cyberbullying detection. Cross-system analyses of the users’ behaviour - monitoring their reactions in different online environments - can facilitate this process and provide information that could lead to more accurate detection of cyberbullying.",
        "title": "Cyberbullying detection; step toward a safer internet yard",
        "type": "paper-conference",
        "publisher": "ACM Press"
      },
      {
        "DOI": "10.1007/978-3-642-31178-9_34",
        "publisher-place": "Berlin",
        "URL": "http://link.springer.com/10.1007/978-3-642-31178-9{\\_}34",
        "page": "277-283",
        "container-title": "17th International Conference on Applications of Natural Language to Information Systems, NLDB 2012",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Ordelman",
            "given": [
              "Roeland"
            ]
          },
          {
            "family": "Jong",
            "dropping-particle": "de",
            "given": [
              "Franciska"
            ]
          },
          {
            "family": "Trieschnigg",
            "given": [
              "Dolf"
            ]
          }
        ],
        "id": "Dadvar2012a",
        "issued": {
          "year": 2012
        },
        "abstract": "Friendships, relationships and social communications have all gone to a new level with new definitions as a result of the invention of online social networks. Meanwhile, alongside this transition there is increasing evidence that online social applications have been used by children and adolescents for bullying. State-of-the-art studies in cyberbullying detection have mainly focused on the content of the conversations while largely ignoring the users involved in cyberbullying. We hypothesis that incorporation of the users’ profile, their characteristics, and post-harassing behaviour, for instance, posting a new status in another social network as a reaction to their bullying experience, will improve the accuracy of cyberbullying detection. Cross-system analyses of the users’ behaviour - monitoring users’ reactions in different online environments - can facilitate this process and could lead to more accurate detection of cyberbullying. This paper outlines the framework for this faceted approach.",
        "title": "Towards User Modelling in the Combat against Cyberbullying",
        "type": "chapter",
        "publisher": "Springer Verlag"
      },
      {
        "publisher-place": "Ghent",
        "URL": "http://purl.utwente.nl/publications/79872",
        "page": "23-26",
        "container-title": "Dutch-Belgian Information Retrieval Workshop, DIR 2012",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Ordelman",
            "given": [
              "Roeland"
            ]
          },
          {
            "family": "De Jong",
            "given": [
              "Franciska"
            ]
          },
          {
            "family": "Trieschnigg",
            "given": [
              "Dolf"
            ]
          }
        ],
        "id": "Dadvar2012b",
        "issued": {
          "year": 2012
        },
        "abstract": "As a result of the invention of social networks, friendships, relationships and social communication are all undergoing changes and new definitions seem to be applicable. One may have hundreds of ‘friends’ without even seeing their faces. Meanwhile, alongside this transition there is increasing evidence that online social applications are used by children and adolescents for bullying. State-of-the-art studies in cyberbullying detection have mainly focused on the content of the conversations while largely ignoring the characteristics of the actors involved in cyberbullying. Social studies on cyberbullying reveal that the written language used by a harasser varies with the author’s features including gender. In this study we used a support vector machine model to train a gender-specific text classifier. We demonstrated that taking gender-specific language features into account improves the discrimination capacity of a classifier to detect cyberbullyi",
        "title": "Improved cyberbullying detection using gender information",
        "type": "paper-conference"
      },
      {
        "publisher-place": "Berlin",
        "URL": "https://www.lap-publishing.com/catalog/details/store/gb/book/978-3-8443-8628-8/who-spoke-when",
        "ISBN": "978-3-8443-8628-8",
        "author": {
          "family": "Dadvar",
          "given": [
            "Maral"
          ]
        },
        "id": "Dadvar2011",
        "issued": {
          "year": 2011
        },
        "abstract": "Speaker diarization is the process which detects active speakers and groups those speech signals which has been uttered by the same speaker. Generally we can find two main applications for speaker diarization. Automatic Speech Recognition systems make use of the speaker homogeneous clusters to adapt the acoustic models to be speaker dependent and therefore increase recognition performance. Speaker indexing and rich transcription systems also use the speaker diarization output as one of information extracted from a recording, which allow its automatic indexation and other further processing. In this study a speaker diarization application is developed – using multiparty binaural speech recordings – to track speaker activity based on interaural time difference (ITD) cues. These cues, for a given speech signal frame, are computed using gammatone filtering and cross-correlation technique. Their values are used to determine which speaker in the recording produce the considered speech fragment. This study has been supervised by Dr. Jon Barker, and defended to fulfill the requirements for the degree of Master in Advanced Computer Science, University of Sheffield, United Kingdom, 2007.",
        "title": "Who spoke when? Audio-based speaker location estimation for diarization.",
        "type": "book",
        "publisher": "LAP Lambert Academic Publishing"
      },
      {
        "publisher-place": "Amsterdam",
        "URL": "http://purl.utwente.nl/publications/76024",
        "page": "16-19",
        "container-title": "Dutch-Belgian Information Retrieval Workshop, DIR 2011",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Hauff",
            "given": [
              "Claudia"
            ]
          },
          {
            "family": "De Jong",
            "given": [
              "Franciska"
            ]
          }
        ],
        "id": "Dadvar2011a",
        "issued": {
          "year": 2011
        },
        "abstract": "An important part of information-gathering behaviour has always been to find out what other people think and whether they have favourable (positive) or unfavourable (negative) opinions about the subject. This survey studies the role of negation in an opinion-oriented information-seeking system. We investigate the problem of determining the polarity of sentiments in movie reviews when negation words, such as not and hardly occur in the sentences. We examine how different negation scopes (window sizes) affect the classification accuracy. We used term frequencies to evaluate the discrimination capacity of our system with different window sizes. The results show that there is no significant difference in classification accuracy when different window sizes have been applied. However, negation detection helped to identify more opinion or sentiment carrying expressions. We conclude that traditional negation detection methods are inadequate for the task of sentiment analysis in this domain and that progress is to be made by exploiting information about how opinions are expressed implicitly",
        "title": "Scope of negation detection in sentiment analysis",
        "type": "paper-conference"
      },
      {
        "URL": "http://purl.utwente.nl/publications/88711",
        "page": 1,
        "container-title": "Computational Linguistics in the Netherlands",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Hondorp",
            "given": [
              "Hendri"
            ]
          },
          {
            "family": "Nijholt",
            "given": [
              "Anton"
            ]
          },
          {
            "family": "Theune",
            "given": [
              "Mariët"
            ]
          },
          {
            "family": "Trieschnigg",
            "given": [
              "Dolf"
            ]
          },
          {
            "family": "Truong",
            "given": [
              "Khiet"
            ]
          }
        ],
        "id": "Dadvar2013b",
        "issued": {
          "year": 2013
        },
        "abstract": "On Friday 18 January 2013, the 23rd meeting of Computational Linguistics in the Netherlands (CLIN 2013) took place in Enschede, The Netherlands. CLIN 2013 was hosted by the Human Media Interaction (HMI) group of the University of Twente. All authors of accepted abstracts were invited to submit a full version of their paper to the current volume (Volume 3) of the CLIN journal. Twenty papers were submitted and they underwent a rigorous review process. We would like to thank all the reviewers as well as the authors of the submitted papers for their hard work. Thirteen of the submitted papers are included in this volume of the CLIN journ",
        "title": "Preface (to: CLIN Journal volume 3)",
        "type": "paper-conference"
      },
      {
        "DOI": "10.13140/RG.2.1.1772.7445",
        "container-title": "Neural Information Processing Systems (NIPS)",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Niamir",
            "given": [
              "Aidin"
            ]
          }
        ],
        "id": "Dadvar2015",
        "issued": {
          "year": 2015
        },
        "abstract": "yberbullying is a widespread problem among children and adolescents. Detection of bully users is one of the main course of actions to combat cyberbullying in social networks. Advances in artificial intelligence along with powerful computational facilities has fueled a rapid increase in predictive modeling of bully users from massive social network’s data. However, low prevalence of bullying incidents made the labelling process costly and laborious. Commonly used cyberbullying methods have been criticized for being inherently dependent on prevalence, and has been argued that low number of target class member (i.e. bully users) introduces statistical artefacts. To overcome this barrier, I proposed the use of the Maximum Entropy (ME) method for modelling of bully users in social networks. ME is a general-purpose machine learning method with a simple and precise mathematical formulation, and it has number of aspects that make it well-suited for cyberbullying studies. In order to evaluate the proposed method, I performed a case study using YouTube dataset. The dataset has been manually labeled as bullying and non-bullying posts. We compiled a set of 11 features in three categories to identify bullying users - namely user features, content features, and activity features - representing the characteristics, actions and behaviour of the users, respectively. ME predictions were compared with those of commonly used modeling methods; Boosted Regression Trees (BRT), Random Forests (RF), and Support Vector Machine (SVM). Predictions were made in 10 steps and in each step 10% of the remaining bullying posts were randomly excluded. All models provided reasonable prediction of the bullying incidents and were significantly better than random in both binomial tests of omission and receiver operating characteristic (ROC) analyses. The area under the ROC curve (AUC) was always higher for ME, indicating better discrimination of bullying post. Performance of ME was more robust and less sensitive towards prevalence. We believe that ME method can be used in its present form for many applications with imbalanced datasets, and merits further research and development.",
        "title": "Maximum Entropy Modelling of Bully Users in Social Networks",
        "type": "paper-conference"
      },
      {
        "publisher-place": "Paris",
        "URL": "\thttp://purl.utwente.nl/publications/80761",
        "container-title": "International Conference on Cyberbullying",
        "author": [
          {
            "family": "Dadvar",
            "given": [
              "Maral"
            ]
          },
          {
            "family": "Jong",
            "dropping-particle": "de",
            "given": [
              "Franciska"
            ]
          }
        ],
        "id": "Dadvar2012c",
        "issued": {
          "year": 2012
        },
        "abstract": "Online social networks brought a new definition to relationships and communications. One may have hundreds of friends in cyberspace without even having seen their real faces. Along with this transition there is increasing evidence that bullying has transformed as well, from school yards to internet precincts – cyberbullying. Although bullying draws a lot of attention, due to its technical aspects, cyberbullying is not fully understood yet. State-of-the-art studies in cyberbullying detection have mainly focused on the sentiment of terms and the content of conversations, while largely ignoring the involved actors and their interactions. A funny chat between teenage friends, just because of having foul words, can be flagged as bullying while a tenacious intruder with subtle but hurtful comments sneaks out. We hypothesize that incorporation of the potential victim’s profile and their characteristics, into cyberbullying detection improves the discrimination capacity of the procedure. This study outlines a framework for this faceted approach. Our study demonstrated that deploying gender-specific and age-specific features improve the cyberbullying detection accuracy for the MySpace dataset, compared to the conventional approaches. Analysis showed that authors’ information can be leveraged to discriminate between harassing posts and the bullying ones. The main limitation of our experiment was the limited size of the dataset. A larger and more diverse dataset should be developed for future work in cyberbullying detection. Other features which may differentiate writing styles, such as profession, and educational level can also be investigated in this matter. In future stages this approach will be extended by considering the behaviour of actors across social networks, and how they react to a potentially cyberbullying incident. A second line of future research will be to address the various use scenarios for the detection of bullying as well as the corresponding detection approaches that may be required in each of the different types of cyber contexts",
        "title": "Improved Cyberbullying Detection Through Personal Profiles",
        "type": "paper-conference"
      }
    ]
  }
]
